In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
t=(1,2,3,4,5)
t*3

(1, 2, 3, 4, 5, 1, 2, 3, 4, 5, 1, 2, 3, 4, 5)

In [3]:
t[2:4]

(3, 4)

In [4]:
if 3 in t:
    print('found')

found

In [5]:
print(t.count(1))
t.index(3)

1

2

In [6]:
(d1,d2,d3,d4,d5)=t
d4

4

In [7]:
students={
    'RollNo':2315200031,
    'Name':'Soham Kundu',
    'FavSub':['DA','WT']
}
students

{'RollNo': 2315200031, 'Name': 'Soham Kundu', 'FavSub': ['DA', 'WT']}

In [8]:
type(students)

dict

In [9]:
len(students)

3

In [10]:
students['Name']

'Soham Kundu'

In [11]:
employee={'Name':'Samarth','Salary':1,'Age':19}
employee

{'Name': 'Samarth', 'Salary': 1, 'Age': 19}

In [12]:
students.get('FavSub')

['DA', 'WT']

In [13]:
students.keys()

dict_keys(['RollNo', 'Name', 'FavSub'])

In [14]:
students.values()

dict_values([2315200031, 'Soham Kundu', ['DA', 'WT']])

In [15]:
students['FavSub'].append('CP')

In [16]:
students.items()

dict_items([('RollNo', 2315200031), ('Name', 'Soham Kundu'), ('FavSub', ['DA', 'WT', 'CP'])])

In [17]:
1 in employee.values()

True

In [18]:
students.popitem()
students

{'RollNo': 2315200031, 'Name': 'Soham Kundu'}

In [19]:
students.clear()
students

{}

In [20]:
mystudents={
    'stud1':{
        'name':'Sachin',
        'year':2004
    },
    'stud2':{
        'name':'Laxman',
        'year':2007
    },
    'stud3':{
        'name':'Ram',
        'year':2011
    }
}
mystudents

{'stud1': {'name': 'Sachin', 'year': 2004},
 'stud2': {'name': 'Laxman', 'year': 2007},
 'stud3': {'name': 'Ram', 'year': 2011}}

In [21]:
for x,y in mystudents.items():
    print(x,y)

stud1 {'name': 'Sachin', 'year': 2004}
stud2 {'name': 'Laxman', 'year': 2007}
stud3 {'name': 'Ram', 'year': 2011}

In [22]:
mystudents['stud2']['year']

2007

In [23]:
student_scores={
    'John':85,
    'Jane':90,
    'Bob':75,
    'Alice':95
    }
student_scores

{'John': 85, 'Jane': 90, 'Bob': 75, 'Alice': 95}

In [24]:
student_scores['Sam']=80

In [25]:
student_scores['Bob']=80

In [26]:
student_scores.pop('Jane')

90

In [27]:
student_scores

{'John': 85, 'Bob': 80, 'Alice': 95, 'Sam': 80}

In [28]:
grades=student_scores.copy()
grades

{'John': 85, 'Bob': 80, 'Alice': 95, 'Sam': 80}

In [29]:
grades['Sam']=95

In [30]:
max=-1
for i in grades.values():
    if  i>max:
        max=i
max

95

In [31]:
[std for std,grd in grades.items() if grd==max]

['Alice', 'Sam']

In [32]:
for i in range(2,2):
    print(i)

In [33]:
dict={'g':2,'e':4,'k':2,'s':2}

In [34]:
list(dict.keys())

['g', 'e', 'k', 's']

In [35]:
d={'a':1,'b':2,'c':3}

In [36]:
print("\na")

a

In [37]:
list(d.keys())

['a', 'b', 'c']

In [38]:
2 in d.values()

True

In [39]:
d['a']

1

In [40]:
key=d.get(d['a'])

In [41]:
type(key)

NoneType

In [42]:
st = "DONALD TRUMPH"
k = [print(i) for i in st if i not in "aeiou"]

D
O
N
A
L
D

T
R
U
M
P
H

In [43]:
def a(l):
    l[0]='A'
l1=[1,2,3]
a(l1)
print(l1)

['A', 2, 3]

In [44]:
sit = "qwertyuiopasdfghjklzxcvbnm"
b=set()
for i in sit:
    b.add(i)
sorted(b,reverse=True)

['z',
 'y',
 'x',
 'w',
 'v',
 'u',
 't',
 's',
 'r',
 'q',
 'p',
 'o',
 'n',
 'm',
 'l',
 'k',
 'j',
 'i',
 'h',
 'g',
 'f',
 'e',
 'd',
 'c',
 'b',
 'a']

In [45]:
import pandas as pd

In [46]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                    "data1": pd.Series(range(6), dtype="Int64")})
df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"],
                    "data2": pd.Series(range(5), dtype="Int64")})

In [47]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [48]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [49]:
pd.merge(df1,df2,on="key",how='right')

   key  data1  data2
0    a      2      0
1    a      4      0
2    b      0      1
3    b      1      1
4    b      5      1
5    a      2      2
6    a      4      2
7    b      0      3
8    b      1      3
9    b      5      3
10   d   <NA>      4

In [50]:
left = pd.DataFrame({"key1": ["foo", "foo", "bar"],
                     "key2": ["one", "two", "one"],
                     "lval": pd.Series([1, 2, 3], dtype='Int64')})
right = pd.DataFrame({"key1": ["foo", "foo", "bar", "bar"],
                      "key2": ["one", "one", "one", "two"],
                      "rval": pd.Series([4, 5, 6, 7], dtype='Int64')})

In [51]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [52]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [53]:
pd.merge(left,right,on='key1',suffixes=['_a','_b'])

  key1 key2_a  lval key2_b  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [54]:
left1 = pd.DataFrame({"key": ["a", "b", "a", "a", "b", "c"],
                      "value": pd.Series(range(6), dtype="Int64")})
right1 = pd.DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [55]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [56]:
right1

   group_val
a        3.5
b        7.0

In [57]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [58]:
import numpy as np
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [59]:
np.concatenate([arr, arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [60]:
s1 = pd.Series([0, 1], index=["a", "b"], dtype="Int64")
s2 = pd.Series([2, 3, 4], index=["c", "d", "e"], dtype="Int64")
s3 = pd.Series([5, 6], index=["f", "g"], dtype="Int64")

In [61]:
print(s1)
print(s2)
print(s3)

a    0
b    1
dtype: Int64
c    2
d    3
e    4
dtype: Int64
f    5
g    6
dtype: Int64

In [62]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [63]:
pd.concat([s1, s2, s3], axis="columns")

      0     1     2
a     0  <NA>  <NA>
b     1  <NA>  <NA>
c  <NA>     2  <NA>
d  <NA>     3  <NA>
e  <NA>     4  <NA>
f  <NA>  <NA>     5
g  <NA>  <NA>     6

In [64]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan, np.nan],
              index=["f", "e", "d", "c", "b", "a","g"])
b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.,9.8],
              index=["a", "b", "c", "d", "e", "f","h"])

In [65]:
pd.concat([a,b], axis = 1)

     0    1
f  NaN  5.0
e  2.5  NaN
d  0.0  NaN
c  3.5  2.0
b  4.5  NaN
a  NaN  0.0
g  NaN  NaN
h  NaN  9.8

In [66]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [67]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [68]:
pd.merge(india_weather,us_weather,how='outer')

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [71]:
pd.concat([india_weather,us_weather],keys=['India','US'])

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [73]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [74]:
windspeed_df = pd.DataFrame({
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

   windspeed
1          7
0         12

In [83]:
pd.concat([temperature_df,windspeed_df],axis=1)

       city  temperature  windspeed
0    mumbai           32       12.0
1     delhi           45        7.0
2  banglore           30        NaN